; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v6 ?v2)
		(pred_2 ?v5)
		(pred_1 ?v7)
		(pred_3 ?v7)
		(pred_5 ?v5 ?v7)
		(pred_4)
		(pred_6 ?v5))

   (:action op_2
       :parameters  (?v1 ?v8)
       :precondition (and (not-eq ?v1 ?v8) 
                          (pred_1 ?v1) (pred_1 ?v8) (pred_3 ?v1))
       :effect (and  (pred_3 ?v8)
		     (not (pred_3 ?v1))))


   (:action op_1
       :parameters (?v4 ?v3)
       :precondition  (and  (pred_2 ?v4) (pred_1 ?v3)
			    (pred_5 ?v4 ?v3) (pred_3 ?v3) (pred_4))
       :effect (and (pred_6 ?v4)
		    (not (pred_5 ?v4 ?v3)) 
		    (not (pred_4))))

   (:action op_3
       :parameters  (?v4  ?v3)
       :precondition  (and  (pred_2 ?v4) (pred_1 ?v3)
			    (pred_6 ?v4) (pred_3 ?v3))
       :effect (and (pred_5 ?v4 ?v3)
		    (pred_4)
		    (not (pred_6 ?v4)))))

; problem
(define (problem ferry-l6-c2)
(:domain ferry)
(:objects obj_04 obj_07 obj_06 obj_03 obj_02 obj_08 
          obj_05 obj_01 
)
(:init
(pred_1 obj_04)
(pred_1 obj_07)
(pred_1 obj_06)
(pred_1 obj_03)
(pred_1 obj_02)
(pred_1 obj_08)
(pred_2 obj_05)
(pred_2 obj_01)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_06)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_02)
(pred_4)
(pred_5 obj_05 obj_04)
(pred_5 obj_01 obj_04)
(pred_3 obj_04)
)
(:goal
(and
(pred_5 obj_05 obj_08)
(pred_5 obj_01 obj_06)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_05 obj_08) (pred_3 obj_07))
    (sometime-before  (pred_5 obj_01 obj_06) (pred_3 obj_07))
  )
)
)

; plan
1. (op_1 obj_05 obj_04)
   deleted: (pred_5 obj_05 obj_04) (pred_4)
   added: (pred_6 obj_05)
   goals met: 0 of 2
2. (op_2 obj_04 obj_06)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_06)
   goals met: 0 of 2
3. (op_3 obj_05 obj_06)
   deleted: (pred_6 obj_05)
   added: (pred_5 obj_05 obj_06) (pred_4)
   goals met: 0 of 2
4. (op_2 obj_06 obj_04)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_04)
   goals met: 0 of 2
5. (op_1 obj_01 obj_04)
   deleted: (pred_5 obj_01 obj_04) (pred_4)
   added: (pred_6 obj_01)
   goals met: 0 of 2
6. (op_2 obj_04 obj_07)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_07)
   goals met: 0 of 2
7. (op_3 obj_01 obj_07)
   deleted: (pred_6 obj_01)
   added: (pred_5 obj_01 obj_07) (pred_4)
   goals met: 0 of 2
8. (op_2 obj_07 obj_06)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_06)
   goals met: 0 of 2
9. (op_1 obj_05 obj_06)
   deleted: (pred_5 obj_05 obj_06) (pred_4)
   added: (pred_6 obj_05)
   goals met: 0 of 2
10. (op_2 obj_06 obj_08)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_08)
   goals met: 0 of 2
11. (op_3 obj_05 obj_08)
   deleted: (pred_6 obj_05)
   added: (pred_5 obj_05 obj_08) (pred_4)
   goals met: 1 of 2
12. (op_2 obj_08 obj_07)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_07)
   goals met: 1 of 2
13. (op_1 obj_01 obj_07)
   deleted: (pred_5 obj_01 obj_07) (pred_4)
   added: (pred_6 obj_01)
   goals met: 1 of 2
14. (op_2 obj_07 obj_06)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_06)
   goals met: 1 of 2
15. (op_3 obj_01 obj_06)
   deleted: (pred_6 obj_01)
   added: (pred_5 obj_01 obj_06) (pred_4)
   goals met: 2 of 2
